I tried a fresh upgrade again:

```
Terraform will perform the following actions:

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      ~ body             = "ok" -> (known after apply)
      ~ id               = "https://sdafasdfsadf.sk1.us-east-1.eks.amazonaws.com/healthz" -> (known after apply)
      - insecure         = false -> null
      ~ response_headers = {
          - "Cache-Control"          = "no-cache, private"
          - "Content-Length"         = "2"
          - "Content-Type"           = "text/plain; charset=utf-8"
          - "Date"                   = "Thu, 30 Sep 2021 14:45:12 GMT"
          - "X-Content-Type-Options" = "nosniff"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster_private_access_cidrs_source will be destroyed
  - resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {
      - cidr_blocks       = [
          - "10.0.0.0/8",
          - "172.16.0.0/12",
          - "192.168.0.0/16",
        ] -> null
      - description       = "Allow private K8S API ingress from custom CIDR source." -> null
      - from_port         = 443 -> null
      - id                = "sgrule-91sdfa596104" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-asdf" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "ingress" -> null
    }

  # module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["10.0.0.0/8"] will be created
  + resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow private K8S API ingress from custom CIDR source."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-asdfasdf"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["172.16.0.0/12"] will be created
  + resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {
      + cidr_blocks              = [
          + "172.16.0.0/12",
        ]
      + description              = "Allow private K8S API ingress from custom CIDR source."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-asdfasdf"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["192.168.0.0/16"] will be created
  + resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {
      + cidr_blocks              = [
          + "192.168.0.0/16",
        ]
      + description              = "Allow private K8S API ingress from custom CIDR source."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-asdfasdf"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }
```

Result

``
`
module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["192.168.0.0/16"]: Creating...
module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["172.16.0.0/12"]: Creating...
module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["10.0.0.0/8"]: Creating...
module.eks.module.node_groups.aws_launch_template.workers["elasticsearch-b"]: Modifying... [id=lt-sdf]
module.eks.module.node_groups.aws_launch_template.workers["infrastructure"]: Modifying... [id=lt-asdf]
module.eks.module.node_groups.aws_launch_template.workers["general_purpose"]: Modifying... [id=lt-asdf]
module.eks.module.node_groups.aws_launch_template.workers["elasticsearch-a"]: Modifying... [id=lt-asdf]
module.eks.module.node_groups.aws_launch_template.workers["elasticsearch-a"]: Modifications complete after 1s [id=lt-asdf]
module.eks.module.node_groups.aws_launch_template.workers["general_purpose"]: Modifications complete after 1s [id=lt-asdf]
module.eks.module.node_groups.aws_launch_template.workers["elasticsearch-b"]: Modifications complete after 1s [id=lt-asdf]
module.eks.module.node_groups.aws_launch_template.workers["infrastructure"]: Modifications complete after 1s [id=lt-asdf]

Warning: Applied changes may be incomplete

The plan was created with the -target option in effect, so some changes
requested in the configuration may have been ignored and the output values may
not be fully updated. Run the following command to verify that no other
changes are pending:
    terraform plan

Note that the -target option is not suitable for routine use, and is provided
only for exceptional situations such as recovering from errors or mistakes, or
when Terraform specifically suggests to use it as part of an error message.


Error: [WARN] A duplicate Security Group rule was found on (sg-asdfasdfdf). This may be
a side effect of a now-fixed Terraform issue causing two security groups with
identical attributes but different source_security_group_ids to overwrite each
other in the state. See https://github.com/hashicorp/terraform/pull/2376 for more
information and instructions for recovery. Error: InvalidPermission.Duplicate: the specified rule "peer: 172.16.0.0/12, TCP, from port: 443, to port: 443, ALLOW" already exists
        status code: 400, request id: 61bfd6a9-2bbc-45a2-a91a-eb752fc7e8ad

  on .terraform/modules/eks/main.tf line 102, in resource "aws_security_group_rule" "cluster_private_access_cidrs_source":
 102: resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {



Error: [WARN] A duplicate Security Group rule was found on (sg-aasdfsdf). This may be
a side effect of a now-fixed Terraform issue causing two security groups with
identical attributes but different source_security_group_ids to overwrite each
other in the state. See https://github.com/hashicorp/terraform/pull/2376 for more
information and instructions for recovery. Error: InvalidPermission.Duplicate: the specified rule "peer: 192.168.0.0/16, TCP, from port: 443, to port: 443, ALLOW" already exists
        status code: 400, request id: 06cbc724-07d1-4287-aaad-c98253b2ce27

  on .terraform/modules/eks/main.tf line 102, in resource "aws_security_group_rule" "cluster_private_access_cidrs_source":
 102: resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {



Error: [WARN] A duplicate Security Group rule was found on (sg-asdfasdf). This may be
a side effect of a now-fixed Terraform issue causing two security groups with
identical attributes but different source_security_group_ids to overwrite each
other in the state. See https://github.com/hashicorp/terraform/pull/2376 for more
information and instructions for recovery. Error: InvalidPermission.Duplicate: the specified rule "peer: 10.0.0.0/8, TCP, from port: 443, to port: 443, ALLOW" already exists
        status code: 400, request id: cddf8a4d-b987-471c-a3f9-e9976b0f2ff2

  on .terraform/modules/eks/main.tf line 102, in resource "aws_security_group_rule" "cluster_private_access_cidrs_source":
 102: resource "aws_security_group_rule" "cluster_private_access_cidrs_source" {

```

And again, I could fix it with a targeted apply

    terraform0-14-11 apply --target=module.eks.aws_security_group_rule.cluster_private_access_cidrs_source